P=[1	5.9688	10.406	18	23.969	31	39.656	48.531	57.094	66.344	75.969	86	93.938	104.91	113.78	125.56	132.53
];
sctravel=[1.6094	2.043	2.5039	3.0586	3.457	3.957	4.543	5.0781	5.5547	6.0469	6.5234	7.043	7.4883	8.0195	8.4922	9.1328	9.4219
];
V=sctravel.*(387.6/1000);
 p1 = polyfit(V,P,5); 
 p2=polyval(p1,V);


 df = polyder(p1); % 导数多项式系数
cWheel = polyval(df, V); % 导数曲线的函数值

hold on
subplot(2,3,1) %将图形窗口分为n行m列个格子(在第k个格子上绘图)
plot(sctravel,P,'*-')
title('压力随位移的关系')%将图形窗口分为n行m列个格子(在第k个格子上绘图)
xlabel('x(mm) ')
ylabel('P(bar)')

subplot(2,3,2) %将图形窗口分为n行m列个格子(在第k个格子上绘图)
plot(V,P,'*-r',V,p2,'g')
title('压力随减少体积的关系及其拟合曲线')%将图形窗口分为n行m列个格子(在第k个格子上绘图)
xlabel('V(ml) ')
ylabel('P(bar)')

subplot(2,3,3) %将图形窗口分为n行m列个格子(在第k个格子上绘图)
plot(V,cWheel,'*-')
title('对曲线求导，得到刚度与减少体积的关系')%将图形窗口分为n行m列个格子(在第k个格子上绘图)
xlabel('V(ml) ')
ylabel('cWheel(bar/ml)')

subplot(2,3,4:6)
plot(P,cWheel,'*-')
title({'因为刚度值并不是常数C，可以建立刚度与减少体积的映射，最终得到刚度与压力的查表曲线，','所以刚度是和压力一一对应的，知道某个时刻的压力就能得到刚度值'})%将图形窗口分为n行m列个格子(在第k个格子上绘图)
xlabel('P（bar） ')
ylabel('cWheel(bar/ml)')

